000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Основная организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDN</name>
    <comment>NAV: Код склада в Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСклада</name>
    <type>
      <types>EnumRef.НазначенияСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <comment>Соответствие организациям в Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КассыККМ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяФормаЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВМагазине</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьКодQR</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЧековНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ПРРО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКассы</name>
    <type>
      <types>EnumRef.ТипыКассККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМ</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЛенты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/ObjectModule.bsl
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ)

//	Если ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "ЗагрузкаИзNavision", Ложь) = Истина Тогда
	Если НЕ ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда

		ПроверитьГеоданныеКонтактнойИнформации(Отказ);

	КонецЕсли;

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЭтоНовый"   , ЭтоНовый());
	ДополнительныеСвойства.Вставить("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Организация"));


КонецПроцедуры

//	LNK 20.04.2017 10:22:47
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;	

	Если НЕ ДополнительныеСвойства.ЭтоНовый Тогда

		Если ЛОЖЬ И НЕ СкладУправляющейСистемы И НЕ ДополнительныеСвойства.Организация = Организация Тогда	//	LNK 26.10.2017 10:09:37 - отключил

			ВыполнитьЗаменуОрганизацииПодчиненныхОбъектов(Истина);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СкладУправляющейСистемы Тогда
		
		УдалитьНепроверяемыеРеквизитыОбъекта(ПроверяемыеРеквизиты);
		
	Иначе

	//	LNK 27.09.2016 07:39:38
		Если Блокирован ИЛИ ПометкаУдаления ИЛИ ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() Тогда

		//	тоже не будем особенно чего проверять... скорее всего, это "мёртвый" магазин.
			УдалитьНепроверяемыеРеквизитыОбъекта(ПроверяемыеРеквизиты);

		КонецЕсли;

		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ОбщегоНазначенияКлиентСервер.AAD("СкладПереброски"));

	//	LNK 27.09.2016 07:44:28
		Если НЕ ПометкаУдаления Тогда

			Если ЗначениеЗаполнено(ВидМинимальныхЦенПродажи)
				И ЗначениеЗаполнено(ПравилоЦенообразования) 
				И ВидМинимальныхЦенПродажи.ЦенаВключаетНДС <> ПравилоЦенообразования.ЦенаВключаетНДС Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"У виду мінімальних цін продажу ознака «Ціна включає ПДВ»
					|не збігається з ознакою «Ціна включає ПДВ» правила ціноутворення.
					|Змініть вигляд мінімальних цін продажу",
					ЭтотОбъект,
					"ВидМинимальныхЦенПродажи",
					,
					Отказ
				);
					
			КонецЕсли;
			
			ИспользоватьАссортимент = АссортиментСервер.ПолучитьФункциональнуюОпциюИспользованияАссортимента();
			Если ИспользоватьАссортимент Тогда
				Если НЕ КонтролироватьАссортимент Тогда
					МассивНепроверяемыхРеквизитов = Новый Массив;
					МассивНепроверяемыхРеквизитов.Добавить("ФорматМагазина");
					ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
				КонецЕсли;
			Иначе
				МассивНепроверяемыхРеквизитов = Новый Массив;
				МассивНепроверяемыхРеквизитов.Добавить("ФорматМагазина");
				ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Блокирован = Ложь;
	ВведенВЭксплуатацию = Ложь;
	ДатаНачалаРаботы = '00010101';
	КассаМагазина    = Неопределено;
	НомерМагазина    = 0;
	КодФилиала       = "";
	СкладПоступления = Справочники.Склады.ПустаяСсылка();
	СкладПродажи     = Справочники.Склады.ПустаяСсылка();
		
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//	LNK 27.09.2016 07:41:36
Процедура УдалитьНепроверяемыеРеквизитыОбъекта(ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ПравилоЦенообразования");
//	МассивНепроверяемыхРеквизитов.Добавить("СкладПоступления");	//	LNK 26.09.2016 10:41:35
	МассивНепроверяемыхРеквизитов.Добавить("СкладПродажи");
	МассивНепроверяемыхРеквизитов.Добавить("СкладСвязи");
	МассивНепроверяемыхРеквизитов.Добавить("ФорматМагазина");
	МассивНепроверяемыхРеквизитов.Добавить("КассаМагазина");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

КонецПроцедуры

//	LNK 20.04.2017 10:26:33
Процедура ВыполнитьЗаменуОрганизацииПодчиненныхОбъектов(РаботатьПоСкладам = Ложь)	Экспорт

//	Вызывается "снаружи" в процедуре получения данных из Navision
//	"ВнешниеИсточники.ОбновитьКлассификаторыПоДаннымNavision()" - тогда заменять в складах НЕ нужно!

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаКассыККМ.Ссылка,
	|	""Владелец"" КАК ИмяРеквизита
	|ИЗ
	|	Справочник.КассыККМ КАК ТаблицаКассыККМ
	|ГДЕ
	|	ТаблицаКассыККМ.Магазин = &Магазин
	|	И НЕ ТаблицаКассыККМ.Владелец = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаКассы.Ссылка,
	|	""Владелец""
	|ИЗ
	|	Справочник.Кассы КАК ТаблицаКассы
	|ГДЕ
	|	ТаблицаКассы.Магазин = &Магазин
	|	И НЕ ТаблицаКассы.Владелец = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСклады.Ссылка,
	|	""Организация""
	|ИЗ
	|	Справочник.Склады КАК ТаблицаСклады
	|ГДЕ
	|	ТаблицаСклады.Магазин = &Магазин
	|	И НЕ ТаблицаСклады.Организация = &Организация
	|	И &РаботатьПоСкладам = ИСТИНА"
	);
	Запрос.УстановитьПараметр("Магазин"    , Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РаботатьПоСкладам", РаботатьПоСкладам);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементОбъект[Выборка.ИмяРеквизита] = Организация;
		ЭлементОбъект.ДополнительныеСвойства.Вставить("СлужебныйРежимЗаписи", Истина);

		ЭлементОбъект.Записать();

	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьГеоданныеКонтактнойИнформации(Отказ)	//	LNK 05.01.2022 06:01:18

	Если ЭтоНовый() Тогда

		Возврат;

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Страна КАК Страна,
	|	КонтактнаяИнформация.Область КАК Область,
	|	КонтактнаяИнформация.Город КАК Город,
	|	КонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	КонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	КонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов
	|ИЗ
	|	Справочник.Магазины.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресМагазина)"
	);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		ГеоданныеВосстановлены = Ложь;

		ДанныеПоСсылке = РезультатЗапроса.Выбрать();
		ДанныеПоСсылке.Следующий();

		Если НЕ ПустаяСтрока(ДанныеПоСсылке.ЗначенияПолей) И КонтактнаяИнформацияКлиентСервер.ЭтоСтрокаXML(ДанныеПоСсылке.ЗначенияПолей) Тогда

			ОбъектXDTO_Ссылка = КонтактнаяИнформацияСлужебный.ДесериализацияАдреса(ДанныеПоСсылке.ЗначенияПолей);
			Геоданные_Ссылка  = ОбъектXDTO_Ссылка.Состав.Состав;

			Если ВРег(ОбъектXDTO_Ссылка.Состав.Страна) = "УКРАЇНА" Тогда

				СтрокиОбъектаАдрес = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид", ДанныеПоСсылке.Тип, ДанныеПоСсылке.Вид));

				Если СтрокиОбъектаАдрес.Количество() = 0 Тогда

				//	Восстанавливаем всё!
					СтрокаТабличнойЧасти = КонтактнаяИнформация.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеПоСсылке);

					ГеоданныеВосстановлены = Истина;

				Иначе

					СтрокаТабличнойЧасти = СтрокиОбъектаАдрес[0];

					Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти.ЗначенияПолей) И КонтактнаяИнформацияКлиентСервер.ЭтоСтрокаXML(СтрокаТабличнойЧасти.ЗначенияПолей) Тогда

						ОбъектXDTO_Объект = КонтактнаяИнформацияСлужебный.ДесериализацияАдреса(СтрокаТабличнойЧасти.ЗначенияПолей);

					Иначе

						ОбъектXDTO_Объект = КонтактнаяИнформацияСлужебный.ДесериализацияАдреса("", СтрокаТабличнойЧасти.Представление,, Истина);

					КонецЕсли;

					Если НЕ ЗначениеЗаполнено(ОбъектXDTO_Объект.Состав.Состав.Долгота) Тогда

						ОбъектXDTO_Объект.Состав.Состав.Долгота = Геоданные_Ссылка.Долгота;
						ГеоданныеВосстановлены = Истина;

					КонецЕсли;

					Если НЕ ЗначениеЗаполнено(ОбъектXDTO_Объект.Состав.Состав.Широта) Тогда

						ОбъектXDTO_Объект.Состав.Состав.Широта = Геоданные_Ссылка.Широта;
						ГеоданныеВосстановлены = Истина;

					КонецЕсли;

					Если ГеоданныеВосстановлены Тогда

						СтрокаТабличнойЧасти.ЗначенияПолей = КонтактнаяИнформацияСлужебный.СериализацияКонтактнойИнформации(ОбъектXDTO_Объект);

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		Если ГеоданныеВосстановлены Тогда

			ЗаписьЖурналаРегистрации("ГЕОДАННЫЕ", УровеньЖурналаРегистрации.Информация
				, Метаданные()
				, Ссылка
				, "Выполнено восстановление геоданных по ссылке"
			);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
